zhiyong-ft/mbed-os/targets/TARGET_STM/TARGET_STM32H5/stm_dma_info.h
/* mbed Microcontroller Library
 * Copyright (c) 2016-2024 STMicroelectronics
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef MBED_OS_STM_DMA_INFO_H
#define MBED_OS_STM_DMA_INFO_H

#include "cmsis.h"
#include "stm_dma_utils.h"

// STM32h5 devices.
// On this device, the DMA channels may be chosen arbitrarily.

/// Mapping from SPI index to DMA link info for Tx
static const DMALinkInfo SPITxDMALinks[] = {
        {1, 0, GPDMA1_REQUEST_SPI1_TX},
        {1, 2, GPDMA1_REQUEST_SPI2_TX},
        {1, 4, GPDMA1_REQUEST_SPI3_TX}
#if defined (SPI4)
        ,{1, 6, GPDMA1_REQUEST_SPI4_TX}
#endif
#if defined (SPI5)
        ,{2, 0, GPDMA2_REQUEST_SPI5_TX}
#endif
#if defined (SPI6)
        ,{2, 2, GPDMA2_REQUEST_SPI6_TX}
#endif
};

/// Mapping from SPI index to DMA link info for Rx
static const DMALinkInfo SPIRxDMALinks[] = {
        {1, 1, GPDMA1_REQUEST_SPI1_RX},
        {1, 3, GPDMA1_REQUEST_SPI2_RX},
        {1, 5, GPDMA1_REQUEST_SPI3_TX}
#if defined (SPI4)
        ,{1, 7, GPDMA1_REQUEST_SPI4_RX}
#endif
#if defined (SPI5)
        ,{2, 1, GPDMA2_REQUEST_SPI5_RX}
#endif
#if defined (SPI6)
        ,{2, 3, GPDMA2_REQUEST_SPI6_RX}
#endif
};

/// Mapping from OSPI index to DMA link info
#ifdef OCTOSPI1
static const DMALinkInfo OSPIDMALinks[] = {
        {2, 4, GPDMA2_REQUEST_OCTOSPI1},
        {2, 5, GPDMA2_REQUEST_OCTOSPI1},
};
#endif

#endif //MBED_OS_STM_DMA_INFO_H
